app/controllers/appointments_controller.rb

  def index
    appointments = Appointment.order('name DESC')
---
SELECT "appointments".* FROM "appointments" ORDER BY name DESC

  def create
  	appointment = Appointment.new(appointment_params)

  	if appointment.save
---
INSERT INTO "appointments" ("name", "from", "to", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "abcasdzxc"], ["from", "2011-07-14T19:43:37+0100"], ["to", "dasdasdasdas"], ["created_at", "2018-07-07 14:47:27.491517"], ["updated_at", "2018-07-07 14:47:27.491517"]]